Model: "model"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_1 (InputLayer)        [(None, 1, 30225, 1)]     0         
                                                                 
 conv2d (Conv2D)             (None, 1, 15109, 4)       36        
                                                                 
 batch_normalization (Batch  (None, 1, 15109, 4)       16        
 Normalization)                                                  
                                                                 
 re_lu (ReLU)                (None, 1, 15109, 4)       0         
                                                                 
 conv2d_1 (Conv2D)           (None, 1, 7553, 32)       640       
                                                                 
 batch_normalization_1 (Bat  (None, 1, 7553, 32)       128       
 chNormalization)                                                
                                                                 
 re_lu_1 (ReLU)              (None, 1, 7553, 32)       0         
                                                                 
 max_pooling2d (MaxPooling2  (None, 1, 151, 32)        0         
 D)                                                              
                                                                 
 permute (Permute)           (None, 32, 151, 1)        0         
                                                                 
 conv2d_2 (Conv2D)           (None, 32, 151, 12)       108       
                                                                 
 batch_normalization_2 (Bat  (None, 32, 151, 12)       48        
 chNormalization)                                                
                                                                 
 re_lu_2 (ReLU)              (None, 32, 151, 12)       0         
                                                                 
 max_pooling2d_1 (MaxPoolin  (None, 16, 75, 12)        0         
 g2D)                                                            
                                                                 
 conv2d_3 (Conv2D)           (None, 16, 75, 12)        1296      
                                                                 
 batch_normalization_3 (Bat  (None, 16, 75, 12)        48        
 chNormalization)                                                
                                                                 
 re_lu_3 (ReLU)              (None, 16, 75, 12)        0         
                                                                 
 conv2d_4 (Conv2D)           (None, 16, 75, 23)        2484      
                                                                 
 batch_normalization_4 (Bat  (None, 16, 75, 23)        92        
 chNormalization)                                                
                                                                 
 re_lu_4 (ReLU)              (None, 16, 75, 23)        0         
                                                                 
 max_pooling2d_2 (MaxPoolin  (None, 8, 37, 23)         0         
 g2D)                                                            
                                                                 
 conv2d_5 (Conv2D)           (None, 8, 37, 18)         3726      
                                                                 
 batch_normalization_5 (Bat  (None, 8, 37, 18)         72        
 chNormalization)                                                
                                                                 
 re_lu_5 (ReLU)              (None, 8, 37, 18)         0         
                                                                 
 conv2d_6 (Conv2D)           (None, 8, 37, 38)         6156      
                                                                 
 batch_normalization_6 (Bat  (None, 8, 37, 38)         152       
 chNormalization)                                                
                                                                 
 re_lu_6 (ReLU)              (None, 8, 37, 38)         0         
                                                                 
 max_pooling2d_3 (MaxPoolin  (None, 4, 18, 38)         0         
 g2D)                                                            
                                                                 
 conv2d_7 (Conv2D)           (None, 4, 18, 43)         14706     
                                                                 
 batch_normalization_7 (Bat  (None, 4, 18, 43)         172       
 chNormalization)                                                
                                                                 
 re_lu_7 (ReLU)              (None, 4, 18, 43)         0         
                                                                 
 conv2d_8 (Conv2D)           (None, 4, 18, 62)         23994     
                                                                 
 batch_normalization_8 (Bat  (None, 4, 18, 62)         248       
 chNormalization)                                                
                                                                 
 re_lu_8 (ReLU)              (None, 4, 18, 62)         0         
                                                                 
 max_pooling2d_4 (MaxPoolin  (None, 2, 9, 62)          0         
 g2D)                                                            
                                                                 
 conv2d_9 (Conv2D)           (None, 2, 9, 58)          32364     
                                                                 
 batch_normalization_9 (Bat  (None, 2, 9, 58)          232       
 chNormalization)                                                
                                                                 
 re_lu_9 (ReLU)              (None, 2, 9, 58)          0         
                                                                 
 conv2d_10 (Conv2D)          (None, 2, 9, 77)          40194     
                                                                 
 batch_normalization_10 (Ba  (None, 2, 9, 77)          308       
 tchNormalization)                                               
                                                                 
 re_lu_10 (ReLU)             (None, 2, 9, 77)          0         
                                                                 
 max_pooling2d_5 (MaxPoolin  (None, 1, 4, 77)          0         
 g2D)                                                            
                                                                 
 dropout (Dropout)           (None, 1, 4, 77)          0         
                                                                 
 conv2d_11 (Conv2D)          (None, 1, 4, 37)          2849      
                                                                 
 batch_normalization_11 (Ba  (None, 1, 4, 37)          148       
 tchNormalization)                                               
                                                                 
 re_lu_11 (ReLU)             (None, 1, 4, 37)          0         
                                                                 
 average_pooling2d (Average  (None, 1, 1, 37)          0         
 Pooling2D)                                                      
                                                                 
 flatten (Flatten)           (None, 37)                0         
                                                                 
 dense (Dense)               (None, 50)                1900      
                                                                 
 softmax (Softmax)           (None, 50)                0         
                                                                 
=================================================================
Total params: 132117 (516.08 KB)
Trainable params: 131285 (512.83 KB)
Non-trainable params: 832 (3.25 KB)